In [3]:
import pandas as pd

In [2]:
#Series de pandas
numeros = [3, 4, 5, 6, 7]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.Series)

In [ ]:
data = {
    
    "Nombre" : ["Kei", "Kenia", "Ana"],
    "Edad" : [22, 16, 15],
    "Ciudad" : ["Cartagena", "Arjona", "Medellin"]

}

data, type(data)

({'Nombre': ['Kei', 'Kenia', 'Ana'],
  'Edad': ['22', '16', '15'],
  'Ciudad': ['Cartagena', 'Arjona', 'Medellin']},
 dict)

In [4]:
#Generar un dataframe a partir de un diccionario

df = pd.DataFrame(data=data)
df

  Nombre Edad     Ciudad
0    Kei   22  Cartagena
1  Kenia   16     Arjona
2    Ana   15   Medellin

In [5]:
#Exportar DataFrame

df.to_csv("data.csv")

In [7]:
#Importar DataFrame

df = pd.read_csv("data.csv", index_col=0)
df

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona
2    Ana    15   Medellin

In [9]:
#Seleccionar una columna

nombres = df["Nombre"]
print(nombres, type(nombres))

0      Kei
1    Kenia
2      Ana
Name: Nombre, dtype: str <class 'pandas.Series'>

In [ ]:
#Seleccionar varias columnas

df[["Nombre", "Edad"]]

  Nombre
0    Kei
1  Kenia
2    Ana

In [15]:
#Para seleccionar filas

Fila = df.loc[2]
Fila

Nombre         Ana
Edad            15
Ciudad    Medellin
Name: 2, dtype: object

In [ ]:
#Filtrar por condicion

df[df["Edad"]>15]

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona

In [17]:
#Para filtrar por datos con inicio de una letra

Filtro = (df["Edad"]>15) & (df["Nombre"].str.startswith("K"))
df[Filtro]

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona

In [18]:
#Filtrar por nombre especifico

df[df["Nombre"].isin(["Kenia", "Ana"])]

  Nombre  Edad    Ciudad
1  Kenia    16    Arjona
2    Ana    15  Medellin

In [23]:
def longitud_5(nombre):
    return len(nombre)== 5
df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad  Ciudad
1  Kenia    16  Arjona

In [24]:
df[df["Edad"].between(15,20)]

  Nombre  Edad    Ciudad
1  Kenia    16    Arjona
2    Ana    15  Medellin

In [25]:
df

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona
2    Ana    15   Medellin

In [1]:
import numpy as np

In [19]:
data = {  "Nombre" : ["Kei", "Kenia", "Ana"],
    "Edad" : [22, np.nan, 15],
    "Ciudad" : ["Cartagena", None, "Medellin"]
}
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Kei  22.0  Cartagena
1  Kenia   NaN        NaN
2    Ana  15.0   Medellin

In [9]:
#Rellenar valores faltantes

df_filled = df.fillna({
    "Edad": df["Edad"].mean(),
    "Ciudad": "Desconocida"
})

df_filled

  Nombre  Edad       Ciudad
0    Kei  15.5    Cartagena
1  Kenia  16.0  Desconocida
2    Ana  15.0     Medellin

In [10]:
#Eliminar las filas sin datos

df_sin_nulos = df.dropna()
df_sin_nulos

  Nombre  Edad    Ciudad
2    Ana  15.0  Medellin

In [12]:
#Remplazar valor especifico de una columna fila

df_replaced = df.replace({
    "Ciudad": {None: "Bogota"}
})
df_replaced

  Nombre  Edad     Ciudad
0    Kei   NaN  Cartagena
1  Kenia  16.0     Bogota
2    Ana  15.0   Medellin

In [20]:
#Interpolar valores faltantes

df_interpolated = df.copy()
df_interpolated["Edad"] = df["Edad"].interpolate()
df_interpolated

  Nombre  Edad     Ciudad
0    Kei  22.0  Cartagena
1  Kenia  18.5        NaN
2    Ana  15.0   Medellin

In [21]:
#Data duplicada

data_duplicada = {
    "Nombre" : ["Kei", "Kenia", "Ana", "Kenia"],
    "Edad" : [22, 16, 15, 16],    
    "Ciudad" : ["Cartagena", "Arjona", "Medellin", "Arjona"]
    }
df_duplicada = pd.DataFrame(data_duplicada)
df_duplicada

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona
2    Ana    15   Medellin
3  Kenia    16     Arjona

In [22]:
#Como quitar los duplicados

df_sin_duplicados = df_duplicada.drop_duplicates()
df_sin_duplicados

  Nombre  Edad     Ciudad
0    Kei    22  Cartagena
1  Kenia    16     Arjona
2    Ana    15   Medellin

In [23]:
#Renombrar columnas

df_renombrado = df.rename(columns={
    "Nombre": "Nombres",
    "Edad": "Edades",
    "Ciudad": "Ciudades"})
df_renombrado

  Nombres  Edades   Ciudades
0     Kei    22.0  Cartagena
1   Kenia     NaN        NaN
2     Ana    15.0   Medellin

In [24]:
#Ordenar columnas

columnas_ordenadas = ["Ciudad", "Nombre", "Edad"]
df_ordenado = df[columnas_ordenadas]
df_ordenado

      Ciudad Nombre  Edad
0  Cartagena    Kei  22.0
1        NaN  Kenia   NaN
2   Medellin    Ana  15.0

In [25]:
#Transformación de datos

def cuadrado(x):
    return x ** 2   

df["Edad_Cuadrado"] = df["Edad"].apply(cuadrado)
df

  Nombre  Edad     Ciudad  Edad_Cuadrado
0    Kei  22.0  Cartagena          484.0
1  Kenia   NaN        NaN            NaN
2    Ana  15.0   Medellin          225.0

In [28]:
#Crear un nuevo DataFrame

data2 = {  
    "Nombre" : ["Keila", "Kenia", "Ana", "Marisol", "Jamer"],
    "Ciudad" : ["Cartagena", "Arjona", "Cartagena", "Arjona", "Arjona"],
    "Edad" : [23, 16, 15, 22, 18],
    "Puntuacion": [85, 90, 78, 88, 92]
}

df2 = pd.DataFrame(data2)
df2

    Nombre     Ciudad  Edad  Puntuacion
0    Keila  Cartagena    23          85
1    Kenia     Arjona    16          90
2      Ana  Cartagena    15          78
3  Marisol     Arjona    22          88
4    Jamer     Arjona    18          92

In [29]:
#Agrupar datos por ciudad por indice

gruped= df2.groupby("Ciudad")
print(gruped.groups)

{'Arjona': [1, 3, 4], 'Cartagena': [0, 2]}

In [32]:
#Agregación de datos 
#Ejemplo: Calcular la suma de las edades y puntuación por ciudad

agregated = gruped.agg({
    "Edad": "mean",
    "Puntuacion": "sum"
})

agregated

                Edad  Puntuacion
Ciudad
Arjona     18.666667         270
Cartagena  19.000000         163